LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	// Reset source
	reg = RCC->CSR;
	if (reg & RCC_CSR_SFTRSTF) {
		result |= RESET_SRC_SOFT;
	} else if (reg & RCC_CSR_PORRSTF) {
		result |= RESET_SRC_POR;
	} else if (reg & RCC_CSR_PINRSTF) {
		result |= RESET_SRC_PIN;
	}

	// Clear the reset flags
	RCC->CSR |= RCC_CSR_RMVF;

	// Enable the PWR peripheral to deal with it CSR register
	RCC->APB1ENR |= RCC_APB1ENR_PWREN;
	__DSB();

	// WKUP pin or RTC alarm
	reg = PWR->CSR;
	if (reg & PWR_CSR_WUF) {
		if (reg & PWR_CSR_SBF) result |= RESET_SRC_STBY;

		// Clear the wake-up and standby flags
		PWR->CR |= PWR_CR_CWUF | PWR_CR_CSBF;

		// Remember value of the AHBENR register
		reg = RCC->AHBENR;

		// Determine state of the WKUP# pins
		RCC->AHBENR |= RCC_AHBENR_GPIOAEN | RCC_AHBENR_GPIOCEN;
		__DSB();
		if (GPIOA->IDR & GPIO_IDR_IDR_0)  result |= RESET_SRC_STBY_WP1;
		if (GPIOC->IDR & GPIO_IDR_IDR_13) result |= RESET_SRC_STBY_WP2;

		// Restore value of the AHBENR register
		RCC->AHBENR = reg;
	}

	return result;
}

// Inquiry status of the button
void Button_Inquiry(BTN_TypeDef *button) {
	if (button == &BTN[BTN_ESCAPE]) {
		// Escape button have inverted input
		if (!(button->PORT->IDR & button->PIN)) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;
			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;

			BEEPER_Enable(2000,1);
		}
	} else {
		if (button->PORT->IDR & button->PIN) {
		    // Button released
			button->hold_cntr = 0;
			if (button->state != BTN_Hold) button->cntr++;
			button->state = BTN_Released;
			// Disable sleep-on-exit (return to main loop from IRQ)
			SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

			BEEPER_Enable(200,1);
		} else {
			// Button pressed
			button->hold_cntr = 0;
			button->state = BTN_Pressed;

			BEEPER_Enable(2000,1);
		}
	}
}

// RTC wake-up IRQ handler
void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt

		// Get current date/time
		RTC_GetDateTime(&_time,&_date);

		_new_time = TRUE;

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_WKUP_EXTI; // Clear the EXTI pending bit
	}
}

// RTC alarm IRQ handler
void RTC_Alarm_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_ALRAF) {
		// RTC alarm A interrupt

		BEEPER_PlayTones(tones_3beep);

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_ALRAF; // Clear the RTC alarm A flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_ALARM_EXTI; // Clear the EXTI pending bit
	}
}

// USART2 IRQ handler
void USART2_IRQHandler(void) {
	uint16_t SR;
	uint16_t rcvd;

	// Read the USART SR register and then DR to clean all possible flags
	SR = GPS_USART_PORT->SR;
	(void)GPS_USART_PORT->DR;

	// USART IDLE line detected
	if (SR & USART_SR_IDLE) {
		// Copy received data from the USART FIFO buffer to the GPS buffer
		rcvd = USART_FIFO_SIZE - USART_FIFO_pos - (uint16_t)DMA1_Channel6->CNDTR; // Amount of received data
		if (rcvd >= (USART_FIFO_SIZE >> 1)) rcvd -= (USART_FIFO_SIZE >> 1); // Data in last half of FIFO
		// Trim GPS data counter to prevent overflow
		if (GPS_buf_cntr + rcvd > GPS_BUFFER_SIZE - 1) rcvd = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],&USART_FIFO[USART_FIFO_pos],rcvd);
		USART_FIFO_pos += rcvd;
		GPS_buf_cntr += rcvd;
		GPS_new_data = TRUE;
	}

	// USART overrun error
	if (SR & USART_SR_ORE) {
		printf(">>> OE: %u\r\n",GPS_buf_cntr);
		GPS_buf_cntr = 0;
	}

/*
	// USART noise error
	if (SR & USART_SR_NE) {
		printf(">>> NE: %u\r\n",GPS_buf_cntr);
		GPS_buf_cntr = 0;
	}

	// USART framing error
	if (SR & USART_SR_FE) {
		printf(">>> FE: %u\r\n",GPS_buf_cntr);
		GPS_buf_cntr = 0;
	}
*/
}


// DMA1 channel6 IRQ handler (USART_RX)
void DMA1_Channel6_IRQHandler() {
	uint16_t rcvd;

	// Channel6 half-transfer
	if (DMA1->ISR & DMA_ISR_HTIF6) {
		// Copy first half of the FIFO buffer to the GPS buffer
		rcvd = (USART_FIFO_SIZE >> 1) - USART_FIFO_pos; // Amount of received data
		// Trim GPS data counter to prevent overflow
		if (GPS_buf_cntr + rcvd > GPS_BUFFER_SIZE - 1) rcvd = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],&USART_FIFO[USART_FIFO_pos],rcvd);
		USART_FIFO_pos = USART_FIFO_SIZE >> 1;
		GPS_buf_cntr += rcvd;

		// Clear the DMA1 channel6 half-transfer flag
		DMA1->IFCR = DMA_IFCR_CHTIF6;
	}


	// Channel6 transfer complete
	if (DMA1->ISR & DMA_ISR_TCIF6) {
		// Copy last half of the FIFO buffer to the GPS buffer
		rcvd = USART_FIFO_SIZE - USART_FIFO_pos; // Amount of received data
		// Trim GPS data counter to prevent overflow
		if (GPS_buf_cntr + rcvd > GPS_BUFFER_SIZE - 1) rcvd = GPS_BUFFER_SIZE - GPS_buf_cntr;
		memcpy(&GPS_buf[GPS_buf_cntr],&USART_FIFO[USART_FIFO_pos],rcvd);
		USART_FIFO_pos = 0;
		GPS_buf_cntr += rcvd;

		// Clear the DMA1 channel6 transfer complete flag
		DMA1->IFCR = DMA_IFCR_CTCIF6;
	}
}

// EXTI0 line IRQ handler
void EXTI0_IRQHandler(void) {
	if (EXTI->PR & BTN3_EXTI) {
		// EXTI0 (Button#3 -> "ESCAPE")
		Button_Inquiry(&BTN[BTN_ESCAPE]);
		EXTI->PR = BTN3_EXTI; // Clear IT bit for EXTI_line
	}
}

// EXTI1 line IRQ handler
void EXTI1_IRQHandler(void) {
	nRF24_RX_PCKT_TypeDef RX_status;
	uint16_t *ptr = (uint16_t *)&nRF24_RX_Buf;

	if (EXTI->PR & nRF24_IRQ_EXTI) {
		RX_status = nRF24_RXPacket(nRF24_RX_Buf,nRF24_RX_PAYLOAD);
		if (RX_status == nRF24_RX_PCKT_PIPE0) {
			// Bytes of 16-bit values must be swapped due to different endianness of STM8L and STM32
/*
			nRF24_Packet.cntr_SPD  =  (nRF24_RX_Buf[0] << 8) | nRF24_RX_Buf[1];
			nRF24_Packet.tim_SPD   =  (nRF24_RX_Buf[2] << 8) | nRF24_RX_Buf[3];
			nRF24_Packet.tim_CDC   =  (nRF24_RX_Buf[4] << 8) | nRF24_RX_Buf[5];
			nRF24_Packet.vrefint   = ((nRF24_RX_Buf[6] << 8) | nRF24_RX_Buf[7]) & 0x03ff;
			nRF24_Packet.cntr_wake =  (nRF24_RX_Buf[8] << 8) | nRF24_RX_Buf[9];
			nRF24_Packet.CRC8      =   nRF24_RX_Buf[10];
*/
			// This code looks cooler and its size is 40 bytes less
			nRF24_Packet.cntr_SPD  = __builtin_bswap16(*ptr++);
			nRF24_Packet.tim_SPD   = __builtin_bswap16(*ptr++);
			nRF24_Packet.tim_CDC   = __builtin_bswap16(*ptr++);
			nRF24_Packet.vrefint   = __builtin_bswap16(*ptr++);
			nRF24_Packet.cntr_wake = __builtin_bswap16(*ptr++);
			nRF24_Packet.CRC8 = nRF24_RX_Buf[10];

			_new_packet = TRUE;

