LonelyWolf/stm32/stm32l151rdt6-dev/main.c
			// Draw time
			ST7541_Fill(0x0000);
			RTC_GetDateTime(&_time,&_date);
			i = 0;
			i += PutIntLZ(i,42,_time.RTC_Hours,2,fnt5x7);
			i += DrawChar(i,42,':',fnt5x7);
			i += PutIntLZ(i,42,_time.RTC_Minutes,2,fnt5x7);
			i += DrawChar(i,42,':',fnt5x7);
			i += PutIntLZ(i,42,_time.RTC_Seconds,2,fnt5x7);
			i += 3;
			i += PutIntLZ(i,42,_date.RTC_Date,2,fnt5x7);
			i += DrawChar(i,42,'.',fnt5x7);
			i += PutIntLZ(i,42,_date.RTC_Month,2,fnt5x7);
			i += DrawChar(i,42,'.',fnt5x7);
			i += PutIntLZ(i,42,_date.RTC_Year,2,fnt5x7);
			PutStr(i + 3,42,RTC_DOW_STR[_date.RTC_WeekDay],fnt5x7);
			ST7541_Flush();

			// This is wake-up from RTC, do BEEP and wait until it ends
			BEEPER_Enable(1111,1);
			while (_beep_duration);
		}

		// Clear the RTC wake-up timer flag
		// The PWR peripheral must be enabled (in GetResetSource)
		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF;
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		// Put MCU into STANDBY mode
		PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
		PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
		SleepStandby();
	}




	// Setup the microcontroller system
	SystemInit();
	SystemCoreClockUpdate();




	// Enable debugging when the MCU is in low power modes
	DBGMCU->CR |= DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;




/*
	// NVIC: 2 bit for preemption priority, 2 bits for subpriority
	// WARNING: this stuff will be re-setup in USB init routine
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
*/




	// Enable the system configuration controller
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;




/*
	// UART port initialization
	UARTx_Init(USART2,USART_RX | USART_TX,1382400);
	UART_SendStr(USART2,"--- STM32L151RDT6 ---\r\n");
*/




/*
	// Enable the RTC wake-up interrupt
	NVICInit.NVIC_IRQChannel = RTC_WKUP_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);

	// Enable the RTC alarm interrupt
	NVICInit.NVIC_IRQChannel = RTC_Alarm_IRQn;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 0x0f; // 0x0f - lowest priority
	NVICInit.NVIC_IRQChannelSubPriority = 0x00;
	NVIC_Init(&NVICInit);
*/

	// Simple enable the RTC wake-up interrupt
	NVIC_EnableIRQ(RTC_WKUP_IRQn);

	// Simple enable the RTC alarm IRQ
	NVIC_EnableIRQ(RTC_Alarm_IRQn);

	// Enable and configure RTC
	RTC_Config();
	if (_reset_source & RESET_SRC_POR) {
		// Set time only in case of POR/PDR (power on/power down reset)
		_time.RTC_Hours   = 0;
		_time.RTC_Minutes = 0;
		_time.RTC_Seconds = 0;
		_date.RTC_Date    = 13;
		_date.RTC_Month   = 02;
		_date.RTC_Year    = 15;
		_date.RTC_WeekDay = RTC_DOW_FRIDAY;
		RTC_SetDateTime(&_time,&_date);
	}
	RTC_ITConfig(RTC_IT_WUT,ENABLE);
	RTC_GetDateTime(&_time,&_date);

//	RTC_SetWakeUp(2); // Wake every 2 seconds
	RTC_SetWakeUp(10); // Wake every 10 seconds
//	RTC_SetWakeUp(30); // Wake every 30 seconds
//	RTC_SetWakeUp(60); // Wake every minute
//	RTC_SetWakeUp(120); // Wake every 2 minutes




	// Initialize delay
	Delay_Init(NULL);




	// Initialize beeper
	BEEPER_Init();




	// Enable power control lines GPIO peripherals
	RCC->AHBENR |= (PWR_GPS_ENABLE_PERIPH | PWR_SD_ENABLE_PERIPH | PWR_VBAT_ENABLE_PERIPH | PWR_LCD_ENABLE_PERIPH);

	// Configure power control lines as push-pull output without pull-up
	PORT.GPIO_Mode  = GPIO_Mode_OUT;
	PORT.GPIO_Speed = GPIO_Speed_400KHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	PORT.GPIO_Pin = PWR_GPS_ENABLE_PIN;
	GPIO_Init(PWR_GPS_ENABLE_PORT,&PORT);
	PWR_GPS_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_SD_ENABLE_PIN;
	GPIO_Init(PWR_SD_ENABLE_PORT,&PORT);
	PWR_SD_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_VBAT_ENABLE_PIN;
	GPIO_Init(PWR_VBAT_ENABLE_PORT,&PORT);
	PWR_VBAT_ENABLE_L(); // Turn it off

	PORT.GPIO_Pin = PWR_LCD_ENABLE_PIN;
	GPIO_Init(PWR_LCD_ENABLE_PORT,&PORT);
	PWR_LCD_ENABLE_L(); // Turn it off




/*
	// Configure the MCO out
	PORT.GPIO_Pin = GPIO_Pin_8;
	PORT.GPIO_Mode = GPIO_Mode_AF;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA,&PORT);
	RCC_MCOConfig(RCC_MCOSource_PLLCLK,RCC_MCODiv_16);
*/




	// Enable the DMA1 peripheral clock
	RCC->AHBENR |= RCC_AHBENR_DMA1EN;

	// Enable DC-DC for LCD
//	PWR_LCD_ENABLE_H();
	PWR_LCD_ENABLE_L();

	// Display SPI port initialization: 1-line TX
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_256); // lowest speed (125kHz on 32MHz CPU)
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_2);   // highest speed (16MHz on 32MHz CPU)
	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_4);   // 8MHz on 32MHz CPU
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_8);   // 4MHz on 32MHz CPU
//	SPIx_Init(ST7541_SPI_PORT,SPI_DIR_TX,SPI_BR_16);  // 2MHz on 32MHz CPU

	// Initialize display and clear screen
	ST7541_InitGPIO();
	ST7541_Init();
//	ST7541_Contrast(6,6,36); // External booster 10.6V
	ST7541_Contrast(7,7,24); // Internal booster/External booster 12.5V
	ST7541_Fill(0x0000);

	// Draw big gray-scaled toppler (logo)
	uint8_t xx,yy,bb;
	ST7541_Contrast(6,6,30); // Internal booster/External booster 12.5V
	ST7541_Fill(0x0000);
	for (yy = 0; yy < 48; yy++) {
		for (xx = 0; xx < 12; xx++) {
			bb = ~toppler_big[(yy * 12) + xx];
			for (i = 4; i--; ) {
				Pixel(40 + (xx << 2) + i,40 + yy,(bb & 0x03));
				bb >>= 2;
			}
		}
	}
	ST7541_Flush_DMA();

	// Initialize the display backlight

	// Backlight pin GPIO configuration
	PORT.GPIO_Mode  = GPIO_Mode_AF;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;
	PORT.GPIO_Pin   = LCD_BL_PIN;
	GPIO_Init(LCD_BL_PORT,&PORT);
	GPIO_PinAFConfig(LCD_BL_PORT,LCD_BL_PIN_SRC,LCD_BL_GPIO_AF);

	// TIM3_CH1 as PWM output
	LCD_BL_TIM_RCC |= LCD_BL_TIM_PERIPH; // Enable the TIMx peripheral
	LCD_BL_TIM->CR1   |= TIM_CR1_ARPE; // Auto-preload enable
	LCD_BL_TIM->CR2    = 0; // Clear this just for any case
	LCD_BL_TIM->CCMR1 |= TIM_CCMR1_OC1PE; // Output compare 1 preload enable
	LCD_BL_TIM->CCMR1 |= TIM_CCMR1_OC1M_2 | TIM_CCMR1_OC1M_1; // PWM mode 1
	LCD_BL_TIM->PSC    = SystemCoreClock / 40000; // 400Hz PWM
	LCD_BL_TIM->ARR    = 99; // 100 levels of backlight
	LCD_BL_TIM->CCR1   = 50; // 50% duty cycle
	LCD_BL_TIM->CCER  |= TIM_CCER_CC1NP | TIM_CCER_CC1E; // Output compare 1 enable, negative polarity
	LCD_BL_TIM->EGR    = 1; // Generate an update event to reload the prescaler value immediately
	LCD_BL_TIM->CR1   |= TIM_CR1_CEN; // Counter enable

