LonelyWolf/stm32/stm32l151rdt6-dev/main.c
	/*
		// Enable the Accelerometer IRQ pin interrupt
		NVICInit.NVIC_IRQChannel = ACC_IRQ_EXTI_N;
		NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
		NVICInit.NVIC_IRQChannelSubPriority = 0;
		NVICInit.NVIC_IRQChannelCmd = ENABLE;
		NVIC_Init(&NVICInit);
	*/

		// Simple enable the Accelerometer IRQ pin interrupt
		NVIC_EnableIRQ(ACC_IRQ_EXTI_N);
	} else {
		printf("FAIL\r\n");
	}




	// End of I2C devices test
    printf("---------------------------------------------\r\n");




	// Put MCU into STANDBY mode
//	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
//	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
//	SleepStop();
//	SleepStandby();
//	while(1);




	PWR_SD_ENABLE_H(); // Turn SD on

	// Enable the DMA2 peripheral clock
	RCC->AHBENR |= RCC_AHBENR_DMA2EN;

	// Enable the DMA2 channel4 interrupt
//	NVIC_EnableIRQ(DMA2_Channel4_IRQn);

	// Enable the SDIO interrupt
//	NVIC_EnableIRQ(SDIO_IRQn);

	if (_SD_connected) {
		SD_SDIO_GPIO_Init();
		j = SD_Init();
		printf("SD_Init: %X\r\n",j);
	} else j = SDR_NoResponse;
	_SD_last_state = _SD_connected;

	if (j == SDR_Success) {
		if (SDCard.Type != SDCT_MMC) {
			// MMC doesn't support 4-bit bus
			if (SDCard.SCR[1] & 0x05) {
				// Set 4-bit bus width
				SD_SetBusWidth(SD_BUS_4BIT);
			}
		}

		// DMA read block test
		for (i = 0; i < 2048; i++) sector[i] = '#';
		i = 2048; // block size
		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,i);
		printf("SD_ReadBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
			j = SD_CheckRead(i);
			printf("SD_CheckRead = %X\r\n",j);
//			if (j == SDR_Success) VCP_SendBufPrintable(sector,i,'.');
//			printf("\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
		}

/*
		// DMA write block test
		for (i = 0; i < 512; i++) {
			sector[i] = sector[i + 1024] - 1;
			if (sector[i] < 33) sector[i] = 127;
			if (sector[i] > 127) sector[i] = 33;
		}
		for (i = 512; i < 1024; i++) {
			sector[i] = sector[i + 1024] + 1;
			if (sector[i] < 33) sector[i] = 127;
			if (sector[i] > 127) sector[i] = 33;
		}
//		j = SD_WriteBlock_DMA(1024,(uint32_t *)sector,2048);
		j = SD_WriteBlock_DMA(1024,(uint32_t *)sector,512);
		printf("SD_WriteBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
//			j = SD_CheckWrite(2048);
			j = SD_CheckWrite(512);
			printf("SD_CheckWrite = %X\r\n",j);
			if (j == SDR_Success) d0++; else d1++;
		} else d1++;
		j = SD_GetCardState(&sector[0]);
		printf("CardState = %X [%X]\r\n",sector[0],j);
	    printf("---------------------------------------------\r\n");
*/

/*
		// Write block test
		for (i = 0; i < 512; i++) sector[i] = '~';
		j = SD_WriteBlock(1024,(uint32_t *)sector,512);
		printf("Write block: %2X\r\n",j);
*/

///*
		// DMA read block test
		for (i = 0; i < 2048; i++) sector[i] = '#';
		i = 2048; // block size
		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,i);
		printf("SD_ReadBlock_DMA = %X\r\n",j);
		if (j == SDR_Success) {
			// Wait till data transfered by DMA
			j = SD_CheckRead(i);
			printf("SD_CheckRead = %X\r\n",j);
//			if (j == SDR_Success) VCP_SendBufPrintable(sector,i,'.');
//			printf("\r\n~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~\r\n");
		}
//*/

/*
		// DMA read speed test
	    RTC_SetWakeUp(10);
	    _new_time = FALSE;
	    uint32_t bc = 0; // Block counter
	    uint32_t oc = 0; // 'Read OK' counter
	    uint32_t fc = 0; // 'Read FAIL' counter
	    while(1) {
	    	while (!_new_time) {
	    		j = SD_ReadBlock_DMA(0,(uint32_t *)sector,sizeof(sector));
	    		if (j == SDR_Success) {
	    			j = SD_CheckRead(sizeof(sector));
	    			if (j == SDR_Success) oc++; else fc++;
	    		} else fc++;
	    		bc++;
	    	}
	    	j = (oc * sizeof(sector));
	    	i = j / 10;
	    	printf("DMA read (block = %ub): %u blocks [%u bytes] (%u OK / %u FAIL) SPEED: ~%u b/s\r\n",sizeof(sector),bc,j,oc,fc,i);
	    	_new_time = FALSE;
	    	oc = 0; fc = 0; bc = 0;
	    }
	    // Single block read (512b):
	    // 16MHz 1-bit: 20850 blocks [10675200 bytes] (20850 OK / 0 FAIL) SPEED: ~1067520 b/s
	    // 16MHz 4-bit: 34664 blocks [17747968 bytes] (34664 OK / 0 FAIL) SPEED: ~1774796 b/s
	    // 24MHz 1-bit: 25415 blocks [13012480 bytes] (25415 OK / 0 FAIL) SPEED: ~1301248 b/s
	    // 24MHz 4-bit: 37650 blocks [19276800 bytes] (37650 OK / 0 FAIL) SPEED: ~1927680 b/s
	    // Multiple block read (2048b):
	    // 16MHz 4-bit: 16611 blocks [34019328 bytes] (16611 OK / 0 FAIL) SPEED: ~3401932 b/s
	    // 24MHz 4-bit: 16607 blocks [34011136 bytes] (16607 OK / 0 FAIL) SPEED: ~3401113 b/s
	    // Multiple block read (8192b):
	    // 24MHz 4-bit: 5716 blocks [46825472 bytes] (5716 OK / 0 FAIL) SPEED: ~4682547 b/s
	    // Multiple block read (16384b):
	    // 24MHz 4-bit: 3050 blocks [49971200 bytes] (3050 OK / 0 FAIL) SPEED: ~4997120 b/s
	    // Multiple block read (32768b):
	    // 24MHz 4-bit: 1578 blocks [51707904 bytes] (1578 OK / 0 FAIL) SPEED: ~5170790 b/s
*/

/*
		// Write block test
		for (i = 0; i < 1024; i++) sector[i] = '%';
		j = SD_WriteBlock(1024,(uint32_t *)sector,1024);
		for (i = 0; i < 2048; i++) sector[i] = '#';
		printf("Write block: %2X\r\n",j);
*/

/*
		// Read block speed test
		d0 = 0; k = 0; i = 0;
		printf("Started------>\r\n");
		do {
			j = SD_ReadBlock(0,(uint32_t *)sector,512);
			if (j != SDR_Success) d0++;
			k += 512;
			i++;
		} while (k < 10485760);
		printf("<--------Ended\r\n");
		printf("Failed: %u from %u\r\n",d0,i);
	    printf("---------------------------------------------\r\n");
*/




/*
		// Log file create test
		j = LOG_Init();
		printf("LOG_Init: #%u\r\n",j);
		if (j == LOG_OK) {
			i = 0;
			j = LOG_NewFile(&i);

			printf("LOG_NewFile: %X [#%u]\r\n",(unsigned int)j,i);

			if (j == LOG_OK) {
				LOG_WriteStr("WBC!\r\n");
				LOG_WriteStr("Shoop da whoop!\r\n");
				for (i = 0; i < 10000; i++) {
					LOG_WriteStr("CNTR=");
					LOG_WriteIntU(i);
					LOG_WriteStr("\r\n");
				}
				LOG_WriteStr("!WBC\r\n");
				LOG_FileSync();
			}
		}
*/

#ifdef NRF24_SOLAR
		// Log file create test
		j = LOG_Init();
		printf("LOG_Init: #%u\r\n",j);
		if (j == LOG_OK) {
			i = 0;
			j = LOG_NewFile(&i);

