LonelyWolf/stm32/stm32l151rdt6-dev/main.c
    // GPS
	printf("GPS initialization...\r\n");

	// Reset GPS variables
	USART_FIFO_pos = 0;
	GPS_buf_cntr = 0;
	GPS_new_data = FALSE;
	GPS_parsed = FALSE;
	GPS_InitData();

	// The GPS USART port initialization
	UARTx_Init(GPS_USART_PORT,USART_TX | USART_RX,9600); // Use slow speed at startup
	UARTx_InitIRQ(GPS_USART_PORT,USART_IRQ_IDLE,0xff); // Enable the USART IDLE IRQ with standard priority

	// Configure the GPS USART DMA
	RCC->AHBENR |= RCC_AHBENR_DMA1EN; // Enable the DMA1 peripheral clock
	UARTx_ConfigureDMA(GPS_USART_PORT,USART_DMA_RX,USART_DMA_BUF_CIRC,USART_FIFO,USART_FIFO_SIZE); // Configure the USART RX DMA channel
	DMA1_Channel6->CCR |= DMA_CCR6_TCIE | DMA_CCR6_HTIE; // Enable the DMA channel6 HT/TC IRQs
	NVIC_EnableIRQ(DMA1_Channel6_IRQn); // Enable the DMA channel6 IRQ
	DMA1->IFCR = DMA_IFCR_CGIF6 | DMA_IFCR_CHTIF6 | DMA_IFCR_CTCIF6 | DMA_IFCR_CTEIF6; // Clear the DMA channel6 IRQ flags
	DMA1_Channel6->CCR |= DMA_CCR1_EN; // Enable the DMA channel6
	GPS_USART_PORT->CR3 |= USART_CR3_DMAR; // Enable the USART receiver DMA

	// Enable power to the GPS module
	PWR_GPS_ENABLE_H();

	// Initialize GPS module
	GPS_Init();




	printf("---------------------------------------------\r\n");
	BEEPER_Enable(2500,1);




/*
	while (1) {
		// Get charger STAT pin state
		i = 0;
		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		printf("FL=%u ",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up
		printf("PU=%u ",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_1; // Pull-down
		printf("PD=%u\r\n",(unsigned int)((CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) ? 1 : 0));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)

		Delay_ms(5000);
	}
*/




/*
    // Configure the RTC alarm A at 30th second on every minute
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 00;
	_time.RTC_Seconds = 30;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_MIN);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 10th minute of every hour
	_time.RTC_Hours   = 00;
	_time.RTC_Minutes = 10;
	_time.RTC_Seconds = 00;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY | RTC_ALARM_MASK_HRS | RTC_ALARM_MASK_SEC);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A

	// Configure the RTC alarm A at 3:30:33 every day
	_time.RTC_Hours   = 03;
	_time.RTC_Minutes = 30;
	_time.RTC_Seconds = 33;

	RTC_AlarmCmd(RTC_ALARM_A,DISABLE); // Disable the alarm A
	RTC_SetAlarm(RTC_ALARM_A,&_time,0,RTC_ALARM_MASK_DAY);
	RTC_ITConfig(RTC_IT_ALRA,ENABLE); // Enable the alarm A interrupt
	RTC_AlarmCmd(RTC_ALARM_A,ENABLE); // Enable the alarm A
*/




	// This for nRF24 packet handling
	uint8_t CRC_local;
	uint16_t wake_diff;

	// Slender head
	int16_t hX = (SCR_W / 2) - 8;
	int16_t hY = (SCR_H / 2) - 8;
	int16_t dX = -1;
	int16_t dY = 1;
	uint8_t sprite = 0;
	int8_t  dspr   = 1;
	uint32_t duty  = 0;

	d0 = 0;
	while(1) {
		while (!GPS_new_data && !_new_packet) {
			ST7541_Fill(0x0000);

			// Draw FPS with shadow effect
			lcd_color = gs_ltgray;
			i = PutIntF(3,3,d0,1,fnt7x10) + 4;
			PutStr(i,3,"FPS",fnt7x10);
			lcd_color = gs_black;
			i = PutIntF(2,2,d0,1,fnt7x10) + 4;
			PutStr(i,2,"FPS",fnt7x10);

			// Draw packets count
			i = 64;
			i += PutStr(i,2,"Pkts:",fnt5x7);
			PutIntU(i,2,_packets_rcvd,fnt5x7);
			i = 64;
			i += PutStr(i,10,"Lost:",fnt5x7);
			PutIntU(i,10,_packets_lost,fnt5x7);

			// Draw time
			RTC_GetDateTime(&_time,&_date);
			i = 0;
			i += PutIntLZ(i,22,_time.RTC_Hours,2,fnt5x7);
			i += DrawChar(i,22,':',fnt5x7);
			i += PutIntLZ(i,22,_time.RTC_Minutes,2,fnt5x7);
			i += DrawChar(i,22,':',fnt5x7);
			i += PutIntLZ(i,22,_time.RTC_Seconds,2,fnt5x7);
			i += 3;
			i += PutIntLZ(i,22,_date.RTC_Date,2,fnt5x7);
			i += DrawChar(i,22,'.',fnt5x7);
			i += PutIntLZ(i,22,_date.RTC_Month,2,fnt5x7);
			i += DrawChar(i,22,'.',fnt5x7);
			i += PutIntLZ(i,22,_date.RTC_Year,2,fnt5x7);
			PutStr(i + 3,22,RTC_DOW_STR[_date.RTC_WeekDay],fnt5x7);

			// GPS info
			i = 0;
			i += PutStr(i,30,"NMEA:",fnt5x7) - 1;
			i += PutIntU(i,30,GPS_sentences_parsed,fnt5x7) - 1;
			i += DrawChar(i,30,'/',fnt5x7) - 1;
			i += PutIntU(i,30,GPS_sentences_unknown,fnt5x7) + 5;
			i += PutStr(i,30,"Size:",fnt5x7) - 1;
			i += PutIntU(i,30,GPS_buf_cntr,fnt5x7);

			i = 0;
			i += PutStr(i,38,"Sat:",fnt5x7) - 1;
			i += PutIntU(i,38,GPSData.sats_used,fnt5x7) - 1;
			i += DrawChar(i,38,'/',fnt5x7) - 1;
			i += PutIntU(i,38,GPSData.sats_view,fnt5x7) + 5;

			i += PutStr(i,38,"Fix:",fnt5x7) - 1;
			i += PutIntU(i,38,GPSData.fix,fnt5x7) + 5;
			i += DrawChar(i,38,GPSData.mode,fnt5x7);

/*
			// Draw Slender's head
			DrawBitmap(hX,hY,12,24,&slender[sprite * 36]);

			// Move and animate Slender's head every 5th frame
			if ((k % 5) == 0) {
				sprite += dspr;
				if ((sprite > 4) || (sprite < 1)) dspr *= -1;

				hX += dX;
				hY += dY;
				if ((hX <  1) || (hX > SCR_W - 12)) dX *= -1;
				if ((hY < 46) || (hY > SCR_H - 24)) dY *= -1;
			}
*/

			// Draw walking toppler (stupid not optimizaed drawing, but it works ^_^)
			for (yy = 0; yy < 16; yy++) {
				for (xx = 0; xx < 4; xx++) {
					if (dX > 0) {
						// Toppler moves from left to right
						bb = ~toppler_walk[(yy * 4) + xx + (sprite << 6)];
						for (i = 4; i--; ) {
							Pixel(hX + (xx << 2) + i,hY + yy,(bb & 0x03));
							bb >>= 2;
						}
					} else {
						// Toppler moves from right to left, must mirror sprite horizontally
						bb = ~toppler_walk[(yy * 4) + 3 - xx + (sprite << 6)];
						for (i = 4; i--; ) {
							Pixel(hX + (xx << 2) + i,hY + yy,(bb & 0xc0) >> 6);
							bb <<= 2;
						}
					}
				}
			}

			// Move and animate toppler every 10th frame
			if ((k % 10) == 0) {
				sprite += dspr;
				if ((sprite > 6) || (sprite < 1)) dspr *= -1;

				hX += dX;
				hY += dY;
				if ((hX <  1) || (hX > SCR_W - 17)) dX *= -1;
				if ((hY < 46) || (hY > SCR_H - 17)) dY *= -1;
			}

			ST7541_Flush_DMA();
			k++;

			if (_new_time) {
				d0 = k;
				k = 0;
				_new_time = FALSE;
			}

