LonelyWolf/stm32/stm32l151rdt6-dev/main.c
			if (BTN[BTN_UP].state == BTN_Pressed) {
		    	if (lcd_backlight < 95) lcd_backlight += 5; else lcd_backlight = 100;
		    	LCD_BL_TIM->CCR1 = lcd_backlight;
		    }
		    if (BTN[BTN_DOWN].state == BTN_Pressed) {
		    	if (lcd_backlight > 5) lcd_backlight -= 5; else lcd_backlight = 0;
		    	LCD_BL_TIM->CCR1 = lcd_backlight;
		    }
		}

		if (GPS_new_data) {
			// Dump a GPS data to the USB VCP
			VCP_SendBuf(GPS_buf,GPS_buf_cntr);

			// Parse received data
			GPS_Parse();
		}

		if (GPS_parsed) {
			// GPS data parsed

			printf("GPS: NMEA=%u/%u SAT=%u/%u FIX=%u MODE=\"%c\" PCKT=\"%sVALID\" ",
					GPS_sentences_parsed,
					GPS_sentences_unknown,
					GPSData.sats_used,
					GPSData.sats_view,
					GPSData.fix,
					GPSData.mode,
					GPSData.valid ? "" : "IN"
			);
			printf("DFIX=%u %u DATE=%u %u DT=\"%sVALID\"  ...  ",
					GPSData.fix_time,
					GPSData.fix_date,
					GPSData.time,
					GPSData.date,
					GPSData.datetime_valid ? "" : "IN"
			);

			// Date and time obtained from GPS
			_time.RTC_Hours   =  GPSData.fix_time / 3600;
			_time.RTC_Minutes = (GPSData.fix_time / 60) % 60;
			_time.RTC_Seconds =  GPSData.fix_time % 60;
			i = GPSData.fix_date / 1000000;
			_date.RTC_Date  = i;
			_date.RTC_Month = (GPSData.fix_date - (i * 1000000)) / 10000;
			if (GPSData.fix_date % 10000 > 1980) {
				_date.RTC_Year = (GPSData.fix_date % 10000) - 2000;
			} else {
				_date.RTC_Year = (GPSData.fix_date % 10000) - 1900;
			}
			RTC_AdjustTimeZone(&_time,&_date,3); // 3 --> +3 GMT offset
//			RTC_CalcDOW(&_date);
			RTC_SetDateTime(&_time,&_date);

			printf("_time: %02u:%02u:%02u _date: %02u.%02u.%02u %s\r\n",
					_time.RTC_Hours,
					_time.RTC_Minutes,
					_time.RTC_Seconds,
					_date.RTC_Date,
					_date.RTC_Month,
					_date.RTC_Year,
					RTC_DOW_STR[_date.RTC_WeekDay]);

			GPS_parsed = FALSE;
		}

		if (_new_packet) {
			CRC_local = CRC8_CCITT(nRF24_RX_Buf,nRF24_RX_PAYLOAD - 1);
			if (CRC_local == nRF24_Packet.CRC8) {
				if (_prev_wake_cntr == 0xDEADBEEF) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (nRF24_Packet.cntr_wake < _prev_wake_cntr) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				wake_diff = nRF24_Packet.cntr_wake - _prev_wake_cntr;

				printf("wake: %u[%u] diff: %u vbat=%u.%02uV pkts: %u\\%u [%u%%]\r\n",
						nRF24_Packet.cntr_wake,
						_prev_wake_cntr,
						wake_diff,
						nRF24_Packet.vrefint / 100,nRF24_Packet.vrefint % 100,
						_packets_rcvd,
						_packets_lost,
						(_packets_lost * 100) / (_packets_rcvd + _packets_lost)
				);

				_prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (wake_diff > 1) {
					_packets_lost += wake_diff - 1;
				}
			}
			_packets_rcvd++;
			_new_packet = FALSE;
		}

		printf("---------------------------------------------\r\n");
	}




	// Measure LCD performance
///*
	// GFX Demo (rotozoomer with checkerboard or XOR texture)
	float ca,sa;
	float scalee = 0.5;
	float dscalee = 0.05;
	float angle = 0.0;
	float x,y;
	float xrow = 0.0;
	float yrow = 0.0;

    RTC_SetWakeUp(10);
    _new_time = FALSE;
    ST7541_Fill(0x0000);
    d0 = 0;
	while(1) {
		ca = scalee * cosf(angle);
		sa = scalee * sinf(angle);
		xrow = sa;
		yrow = ca;
		for (j = 48; j < 127; j++) {
			x = xrow;
			y = yrow;
			for (i = 1; i < 127; i++) {
				x += ca;
				y += sa;
//				Pixel(i,j,((((int8_t)x >> 3) & 1) ^ (((int8_t)y >> 3) & 1)) ? gs_black : gs_white); // Black and white checker board
				Pixel(i,j,(((int8_t)x >> 3) & 3) ^ (((int8_t)y >> 3) & 3)); // 2-bit XOR texture
			}
			xrow += -sa;
			yrow +=  ca;
		}
		angle += 0.05;
		scalee += ((scalee <= 0.10) || (scalee >= 1.3)) ? dscalee *= -1: dscalee;

		Rect(0,47,127,127,gs_black);
		FillRect(0,0,127,46,gs_white);

		// Draw FPS with shadow effect
		lcd_color = gs_ltgray;
		i = PutIntF(4,4,d0,1,fnt7x10) + 4;
		PutStr(i,4,"FPS",fnt7x10);
		lcd_color = gs_dkgray;
		i = PutIntF(3,3,d0,1,fnt7x10) + 4;
		PutStr(i,3,"FPS",fnt7x10);
		lcd_color = gs_black;
		i = PutIntF(2,2,d0,1,fnt7x10) + 4;
		PutStr(i,2,"FPS",fnt7x10);

		// Draw packets count
		i = 64;
		i += PutStr(i,2,"Pkts:",fnt5x7);
		PutIntU(i,2,_packets_rcvd,fnt5x7);
		i = 64;
		i += PutStr(i,10,"Lost:",fnt5x7);
		PutIntU(i,10,_packets_lost,fnt5x7);

		// Draw time
		RTC_GetDateTime(&_time,&_date);
		i = 0;
		i += PutIntLZ(i,22,_time.RTC_Hours,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Minutes,2,fnt5x7);
		i += DrawChar(i,22,':',fnt5x7);
		i += PutIntLZ(i,22,_time.RTC_Seconds,2,fnt5x7);
		i += 3;
		i += PutIntLZ(i,22,_date.RTC_Date,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Month,2,fnt5x7);
		i += DrawChar(i,22,'.',fnt5x7);
		i += PutIntLZ(i,22,_date.RTC_Year,2,fnt5x7);
		PutStr(i + 3,22,RTC_DOW_STR[_date.RTC_WeekDay],fnt5x7);

		// GPS info
		i = 0;
		i += PutStr(i,30,"NMEA:",fnt5x7) - 1;
		i += PutIntU(i,30,GPS_sentences_parsed,fnt5x7) - 1;
		i += DrawChar(i,30,'/',fnt5x7) - 1;
		i += PutIntU(i,30,GPS_sentences_unknown,fnt5x7) + 5;
		i += PutStr(i,30,"Fix:",fnt5x7) - 1;
		i += PutIntU(i,30,GPSData.fix,fnt5x7) + 5;
		i += DrawChar(i,30,GPSData.mode,fnt5x7);
		i = 0;
		i += PutStr(i,38,"Sat:",fnt5x7) - 1;
		i += PutIntU(i,38,GPSData.sats_used,fnt5x7) - 1;
		i += DrawChar(i,38,'/',fnt5x7) - 1;
		i += PutIntU(i,38,GPSData.sats_view,fnt5x7) - 1;


		ST7541_Flush_DMA();
		k++;

		if (GPS_new_data) {
			// New GPS packet received

			// Dump a GPS data to the USB VCP
			VCP_SendBuf(GPS_buf,GPS_buf_cntr);

			// Parse received data
			GPS_Parse();
		}

		if (GPS_parsed) {
			// GPS data parsed
			printf("GPS parsed: PCKT=%s DT=%s FIX=%u %u DATE=%u %u\r\n--------\r\n",
					GPSData.valid ? "VALID" : "INVALID",
					GPSData.datetime_valid ? "VALID" : "INVALID",
					GPSData.fix_time,
					GPSData.fix_date,
					GPSData.time,
					GPSData.date
			);

			// Date and time obtained from GPS
			_time.RTC_Hours   =  GPSData.fix_time / 3600;
			_time.RTC_Minutes = (GPSData.fix_time / 60) % 60;
			_time.RTC_Seconds =  GPSData.fix_time % 60;
			i = GPSData.fix_date / 1000000;
			_date.RTC_Date  = i;
			_date.RTC_Month = (GPSData.fix_date - (i * 1000000)) / 10000;
			if (GPSData.fix_date % 10000 > 1980) {
				_date.RTC_Year = (GPSData.fix_date % 10000) - 2000;
			} else {
				_date.RTC_Year = (GPSData.fix_date % 10000) - 1900;
			}
//			RTC_AdjustTimeZone(&_time,&_date,3); // 3 --> +3 GMT offset
			RTC_CalcDOW(&_date);
			RTC_SetDateTime(&_time,&_date);

			printf("_time: %02u:%02u:%02u _date: %02u.%02u.%02u %s\r\n",
					_time.RTC_Hours,
					_time.RTC_Minutes,
					_time.RTC_Seconds,
					_date.RTC_Date,
					_date.RTC_Month,
					_date.RTC_Year,
					RTC_DOW_STR[_date.RTC_WeekDay]);

