LonelyWolf/stm32/stm32l151rdt6-dev/main.c
/*
			if (GPSData.datetime_valid) {
				// Date and time obtained from GPS
				_time.RTC_Hours   =  GPSData.time / 3600;
				_time.RTC_Minutes = (GPSData.time / 60) % 60;
				_time.RTC_Seconds =  GPSData.time % 60;
				i = GPSData.date / 1000000;
				_date.RTC_Date  = i;
				_date.RTC_Month = (GPSData.date - (i * 1000000)) / 10000;
				_date.RTC_Year  = (GPSData.date % 10000) - 2000;
				RTC_AdjustTimeZone(&_time,&_date,3); // 3 --> +3 GMT offset
				RTC_SetDateTime(&_time,&_date);
			}
*/
			GPS_parsed = FALSE;
		}

		if (_new_time) {
			d0 = k;
			_new_time = FALSE;
			k = 0;
		}

		if (_new_packet) {
			CRC_local = CRC8_CCITT(nRF24_RX_Buf,nRF24_RX_PAYLOAD - 1);
			if (CRC_local == nRF24_Packet.CRC8) {
				if (_prev_wake_cntr == 0xDEADBEEF) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (nRF24_Packet.cntr_wake < _prev_wake_cntr) _prev_wake_cntr = nRF24_Packet.cntr_wake;
				wake_diff = nRF24_Packet.cntr_wake - _prev_wake_cntr;
				printf("wake: %u[%u] diff: %u vbat=%u.%02uV pkts: %u\\%u [%u%%]\r\n",
						nRF24_Packet.cntr_wake,
						_prev_wake_cntr,
						wake_diff,
						nRF24_Packet.vrefint / 100,nRF24_Packet.vrefint % 100,
						_packets_rcvd,
						_packets_lost,
						(_packets_lost * 100) / (_packets_rcvd + _packets_lost)
				);
				_prev_wake_cntr = nRF24_Packet.cntr_wake;
				if (wake_diff > 1) {
					_packets_lost += wake_diff - 1;
				}
			}
			_packets_rcvd++;
			_new_packet = FALSE;
		}

	    if (BTN[BTN_UP].state == BTN_Pressed) {
	    	if (lcd_backlight < 95) lcd_backlight += 5; else lcd_backlight = 100;
	    	LCD_BL_TIM->CCR1 = lcd_backlight;
	    }
	    if (BTN[BTN_DOWN].state == BTN_Pressed) {
	    	if (lcd_backlight > 5) lcd_backlight -= 5; else lcd_backlight = 0;
	    	LCD_BL_TIM->CCR1 = lcd_backlight;
	    }
	    if (BTN[BTN_ESCAPE].state == BTN_Pressed) {
	    	// Reset the MCU
//	    	NVIC_SystemReset();

	    	// Setup partial display mode
			ST7541_SetDisplayPartial(32,0,64);
			ST7541_Contrast(5,5,10);

	    	// Put MCU into STANDBY mode
	    	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	    	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	    	SleepStandby();
	    }
	}
//*/

    ST7541_Fill(0x0000);
	k = 0;
    for (i = 0; i < 8; i++) {
		d0 = 16 + (i * 12);
    	for (j = 0; j < 8; j++) {
    		d1 = 29 + (j * 12);
    		FillRect(d0,d1,d0 + 11,d1 + 11,(k) ? gs_white : gs_ltgray);
    		Rect(d0,d1,d0 + 11,d1 + 11,gs_black);
    		k = !k;
    	}
    	k = !k;
    }
    Rect(0,0,127,127,gs_black);
    ST7541_Flush_DMA();
    while(1);

/*
    // Test partial display and power saving
	ST7541_Flush();
	Delay_ms(2000);
	ST7541_Contrast(5,5,10);
	ST7541_SetDisplayPartial(32,0,64);
	Delay_ms(4000);
	ST7541_PowerSave(ON);
	Delay_ms(10000);
	ST7541_PowerSave(OFF);
	ST7541_SetDisplayPartial(0,0,128);
	ST7541_Contrast(lcd_res_ratio,lcd_lcd_bias,lcd_el_vol);
*/

    RTC_SetWakeUp(10);
    _new_time = FALSE;
	while(1) {
		k = 0;
		while (!_new_time) {
			ST7541_Flush_DMA();
//			ST7541_Flush();
			k++;
		}
		FillRect(2,2,63,12,gs_white);
		i = PutIntF(2,2,k,1,fnt7x10) + 2;
		PutStr(i,2,"FPS",fnt7x10);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				RTC_DOW_STR[_date.RTC_WeekDay],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);
		printf("FPS = %u.%u\r\n",k / 10,k % 10);
		_new_time = FALSE;
	}
	// Results with 125kHz
	// ST7541_data :   3.8FPS
	// SPIx_SendBuf:   3.8FPS
	// DMA         :   3.8FPS

	// Result with 2MHz
	// ST7541_data :  34.7FPS
	// SPIx_SendBuf:  60.9FPS
	// DMA         :  60.9FPS

	// Result with 4MHz
	// ST7541_data :  47.3FPS
	// SPIx_SendBuf: 121.7FPS
	// SPIx_SendBuf16: 121.7FPS
	// DMA         : 121.7FPS

	// Result with 8MHz
	// ST7541_data :  57.4FPS
	// SPIx_SendBuf: 149.9FPS
	// SPIx_SendBuf_2: 204.7FPS
	// SPIx_Sendbuf16: 242.9FPS
	// DMA         : 243.0FPS
	// DMA16       : 242.7FPS

	// Results with 16MHz
	// ST7541_data :  64.5FPS
	// SPIx_SendBuf: 149.9FPS
	// SPIx_SendBuf_2: 204.8FPS
	// SPIx_SendBuf16: 430.4FPS <-- FAIL (LCD is not fast enough for this)
	// DMA         : 430.2FPS <-- FAIL (LCD is not fast enough for this)
	// DMA16       : 482.8FPS <-- FAIL (LCD is not fast enough for this)




	while(1) {
		// Date/time
		RTC_GetDateTime(&_time,&_date);
		printf("DTM: %s, %02u:%02u:%02u %02u.%02u.20%02u\r\n",
				RTC_DOW_STR[_date.RTC_WeekDay],
				_time.RTC_Hours,
				_time.RTC_Minutes,
				_time.RTC_Seconds,
				_date.RTC_Date,
				_date.RTC_Month,
				_date.RTC_Year
			);

//		printf("BTN: #0 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_10) ? "HI" : "LOW");
//		printf("BTN: #1 IDR=%s\r\n",(GPIOB->IDR & GPIO_Pin_11) ? "HI" : "LOW");
//		printf("BTN: #2 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_15) ? "HI" : "LOW");
//		printf("BTN: #3 IDR=%s\r\n",(GPIOA->IDR & GPIO_Pin_0)  ? "HI" : "LOW");

		// Buttons
		for (i = 0; i < 4; i++) {
			printf("BTN: #%u CNTR=%u HOLD=%u STATE=%02X IDR=%s\r\n",
					i,
					BTN[i].cntr,
					BTN[i].hold_cntr,
					BTN[i].state,
					(BTN[i].PORT->IDR & BTN[i].PIN) ? "HI" : "LOW");
		}

		// Measure Vbat
/*
		// Do 16 ADC measurements and calculate rough average
		ADC1_raw = 0;
		Vrefint_raw = 0;
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raw    += ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raw += ADC1->JDR2; // Read injected data register2 (ADC_IN17)
			if (i) {
				ADC1_raw >>= 1;
				Vrefint_raw >>= 1;
			}
			ADC1->SR &= ~ADC_SR_JEOC; // Clear JEOC bit (is this necessary?)
		}
*/

		// Do 16 ADC measurements
		for (i = 0; i < 16; i++) {
			ADC1->CR2 |= ADC_CR2_JSWSTART; // Start conversion of injected channels
			while (!(ADC1->SR & ADC_SR_JEOC)); // Wait until ADC conversions end
			ADC1_raws[i]    = ADC1->JDR1; // Read injected data register1 (ADC_IN1)
			Vrefint_raws[i] = ADC1->JDR2; // Read injected data register2 (ADC_IN17)
		}
		// Calculate interquartile mean values of ADC readings
		ADC1_raw = InterquartileMean(ADC1_raws,16);
		Vrefint_raw = InterquartileMean(Vrefint_raws,16);

		// Convert ADC readings to voltage
		Vbat = (uint16_t)(((*VREFINT_CAL * ADC1_raw * 3.0)/(Vrefint_raw * 4095.0)) * 1000);
		Vrefint = (uint16_t)(((Vrefint_raw * 3.0) / 4095.0) * 1000);
		Vcpu = (uint16_t)(((*VREFINT_CAL * 3.0) / Vrefint_raw) * 1000);
		printf("VOL: Bat=[%u.%03uV -> %u.%03uV] Ref=%u.%03uV CPU=%u.%03uV\r\n",
				(unsigned int)Vbat / 1000, (unsigned int)Vbat % 1000,
				((unsigned int)Vbat / 1000) * 2, ((unsigned int)Vbat % 1000) * 2,
				(unsigned int)Vrefint / 1000, (unsigned int)Vrefint % 1000,
				(unsigned int)Vcpu / 1000, (unsigned int)Vcpu % 1000);

